axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_dma.c
/**
*\*\name    DMA_Interrupts_Disable.
*\*\fun     DMA Channel x interrupts disable. This function is usually called
*\*\        after the DMA transfer has completed.
*\*\param   DMAChx (The input parameters must be the following values):
*\*\          - DMA_CH1
*\*\          - DMA_CH2
*\*\          - DMA_CH3
*\*\          - DMA_CH4
*\*\          - DMA_CH5
*\*\          - DMA_CH6
*\*\          - DMA_CH7
*\*\          - DMA_CH8
*\*\param   interrupt (The input parameters must be the following values):
*\*\          - DMA_INT_TXC
*\*\          - DMA_INT_HTX
*\*\          - DMA_INT_ERR
*\*\return  none
**/
void DMA_Interrupts_Disable(DMA_ChannelType* DMAChx, uint32_t interrupt)
{
    /* Disable the selected DMA Channelx interrupts */
    DMAChx->CHCFG &= (~interrupt);
}

/**
*\*\name    DMA_Current_Data_Transfer_Number_Set.
*\*\fun     Set the current number of data transfers for DMA Channel x.
*\*\param   DMAChx (The input parameters must be the following values):
*\*\          - DMA_CH1
*\*\          - DMA_CH2
*\*\          - DMA_CH3
*\*\          - DMA_CH4
*\*\          - DMA_CH5
*\*\          - DMA_CH6
*\*\          - DMA_CH7
*\*\          - DMA_CH8
*\*\param   num :
*\*\          - 1~0xFFFF
*\*\return  none
*\*\note    This function can only be used when the DMAChx is disabled.
**/
void DMA_Current_Data_Transfer_Number_Set(DMA_ChannelType* DMAChx, uint16_t num)
{
    /* Write to DMA Channelx TXNUM */
    DMAChx->TXNUM = num;
}

/**
*\*\name    DMA_Current_Data_Transfer_Number_Get.
*\*\fun     Get the current number of remaining data for DMA Channel x.
*\*\param   DMAChx (The input parameters must be the following values):
*\*\          - DMA_CH1
*\*\          - DMA_CH2
*\*\          - DMA_CH3
*\*\          - DMA_CH4
*\*\          - DMA_CH5
*\*\          - DMA_CH6
*\*\          - DMA_CH7
*\*\          - DMA_CH8
*\*\return  Returns the number of bytes remaining to be transferred.
**/
uint16_t DMA_Current_Data_Transfer_Number_Get(DMA_ChannelType* DMAChx)
{
    /* Returns the number of remaining to be transferred for DMA Channelx */
    return ((uint16_t)(DMAChx->TXNUM));
}

/**
*\*\name    DMA_Flag_Status_Get.
*\*\fun     Get DMA Channel x flag status. Contains the global flag, transfer
*\*\        completion flag, half-transfer flag, and transfer error flag for
*\*\        the corresponding channel.
*\*\param   DMAx (The input parameters must be the following values):
*\*\          - DMA
*\*\param   flag (The input parameters must be the following values):
*\*\          - DMA_CH1_GLBF
*\*\          - DMA_CH1_TXCF
*\*\          - DMA_CH1_HTXF
*\*\          - DMA_CH1_ERRF
*\*\          - DMA_CH2_GLBF
*\*\          - DMA_CH2_TXCF
*\*\          - DMA_CH2_HTXF
*\*\          - DMA_CH2_ERRF
*\*\          - DMA_CH3_GLBF
*\*\          - DMA_CH3_TXCF
*\*\          - DMA_CH3_HTXF
*\*\          - DMA_CH3_ERRF
*\*\          - DMA_CH4_GLBF
*\*\          - DMA_CH4_TXCF
*\*\          - DMA_CH4_HTXF
*\*\          - DMA_CH4_ERRF
*\*\          - DMA_CH5_GLBF
*\*\          - DMA_CH5_TXCF
*\*\          - DMA_CH5_HTXF
*\*\          - DMA_CH5_ERRF
*\*\          - DMA_CH6_GLBF
*\*\          - DMA_CH6_TXCF
*\*\          - DMA_CH6_HTXF
*\*\          - DMA_CH6_ERRF
*\*\          - DMA_CH7_GLBF
*\*\          - DMA_CH7_TXCF
*\*\          - DMA_CH7_HTXF
*\*\          - DMA_CH7_ERRF
*\*\          - DMA_CH8_GLBF
*\*\          - DMA_CH8_TXCF
*\*\          - DMA_CH8_HTXF
*\*\          - DMA_CH8_ERRF
*\*\return  SET or RESET.
**/
FlagStatus DMA_Flag_Status_Get(DMA_Module* DMAx, uint32_t flag)
{
    /* Check the status of the DMA flag */
    if ((DMAx->INTSTS & flag) == (uint32_t)RESET)
    {
        /* DMA_CHx_Flag is reset */
        return RESET;
    }
    else
    {
        /* DMA_CHx_Flag is set */
        return SET;
    }
}

/**
*\*\name    DMA_Flag_Status_Clear.
*\*\fun     Clear DMA Channel x flag status. Contains the global flag, transfer
*\*\        completion flag, half-transfer flag, and transfer error flag for the
*\*\        corresponding channel.
*\*\param   DMAx (The input parameters must be the following values):
*\*\          - DMA
*\*\param   flag (The input parameters must be the following values):
*\*\          - DMA_CH1_GLBF
*\*\          - DMA_CH1_TXCF
*\*\          - DMA_CH1_HTXF
*\*\          - DMA_CH1_ERRF
*\*\          - DMA_CH2_GLBF
*\*\          - DMA_CH2_TXCF
*\*\          - DMA_CH2_HTXF
*\*\          - DMA_CH2_ERRF
*\*\          - DMA_CH3_GLBF
*\*\          - DMA_CH3_TXCF
*\*\          - DMA_CH3_HTXF
*\*\          - DMA_CH3_ERRF
*\*\          - DMA_CH4_GLBF
*\*\          - DMA_CH4_TXCF
*\*\          - DMA_CH4_HTXF
*\*\          - DMA_CH4_ERRF
*\*\          - DMA_CH5_GLBF
*\*\          - DMA_CH5_TXCF
*\*\          - DMA_CH5_HTXF
*\*\          - DMA_CH5_ERRF
*\*\          - DMA_CH6_GLBF
*\*\          - DMA_CH6_TXCF
*\*\          - DMA_CH6_HTXF
*\*\          - DMA_CH6_ERRF
*\*\          - DMA_CH7_GLBF
*\*\          - DMA_CH7_TXCF
*\*\          - DMA_CH7_HTXF
*\*\          - DMA_CH7_ERRF
*\*\          - DMA_CH8_GLBF
*\*\          - DMA_CH8_TXCF
*\*\          - DMA_CH8_HTXF
*\*\          - DMA_CH8_ERRF
*\*\return  none.
**/
void DMA_Flag_Status_Clear(DMA_Module* DMAx, uint32_t flag)
{
    /* Clear DMA flags */
    DMAx->INTCLR = flag;
}

/**
*\*\name    DMA_Interrupt_Status_Get.
*\*\fun     Get DMA Channel x interrupt status. Contains the global interrupt,
*\*\        transfer completion interrupt, half-transfer interrupt, and transfer
*\*\        error interrupt for the corresponding channel.
*\*\param   DMA (The input parameters must be the following values):
*\*\          - DMA
*\*\param   interrupt (The input parameters must be the following values):
*\*\          - DMA_CH1_INT_GLB
*\*\          - DMA_CH1_INT_TXC
*\*\          - DMA_CH1_INT_HTX
*\*\          - DMA_CH1_INT_ERR
*\*\          - DMA_CH2_INT_GLB
*\*\          - DMA_CH2_INT_TXC
*\*\          - DMA_CH2_INT_HTX
*\*\          - DMA_CH2_INT_ERR
*\*\          - DMA_CH3_INT_GLB
*\*\          - DMA_CH3_INT_TXC
*\*\          - DMA_CH3_INT_HTX
*\*\          - DMA_CH3_INT_ERR
*\*\          - DMA_CH4_INT_GLB
*\*\          - DMA_CH4_INT_TXC
*\*\          - DMA_CH4_INT_HTX
*\*\          - DMA_CH4_INT_ERR
*\*\          - DMA_CH5_INT_GLB
*\*\          - DMA_CH5_INT_TXC
*\*\          - DMA_CH5_INT_HTX
*\*\          - DMA_CH5_INT_ERR
*\*\          - DMA_CH6_INT_GLB
*\*\          - DMA_CH6_INT_TXC
*\*\          - DMA_CH6_INT_HTX
*\*\          - DMA_CH6_INT_ERR
*\*\          - DMA_CH7_INT_GLB
*\*\          - DMA_CH7_INT_TXC
*\*\          - DMA_CH7_INT_HTX
*\*\          - DMA_CH7_INT_ERR
*\*\          - DMA_CH8_INT_GLB
*\*\          - DMA_CH8_INT_TXC
*\*\          - DMA_CH8_INT_HTX
*\*\          - DMA_CH8_INT_ERR
*\*\return  SET or RESET.
*\*\note    Global interrupt status is the logic or generation of transfer completion
*\*\        interrupt, half-transfer interrupt, transfer error interrupt.
**/
INTStatus DMA_Interrupt_Status_Get(DMA_Module* DMAx, uint32_t interrupt)
{
    /* Check the status of the specified DMA interrupt */
    if ((DMAx->INTSTS & interrupt) == (uint32_t)RESET)
    {
        /* DMA_CHx_IT is reset */
        return RESET;
    }
    else
    {
        /* DMA_CHx_IT is set */
        return SET;
    }
}

/**
*\*\name    DMA_Interrupt_Status_Clear.
*\*\fun     Clear DMA Channel x interrupt status bits. Contains the global interrupt,
*\*\        transfer completion interrupt, half-transfer interrupt, and transfer
*\*\        error interrupt for the corresponding channel.
*\*\param   DMAx (The input parameters must be the following values):
*\*\          - DMA
*\*\param   interrupt (The input parameters must be the following values):
*\*\          - DMA_CH1_INT_GLB
*\*\          - DMA_CH1_INT_TXC
*\*\          - DMA_CH1_INT_HTX
*\*\          - DMA_CH1_INT_ERR
*\*\          - DMA_CH2_INT_GLB
*\*\          - DMA_CH2_INT_TXC
*\*\          - DMA_CH2_INT_HTX
*\*\          - DMA_CH2_INT_ERR
*\*\          - DMA_CH3_INT_GLB
*\*\          - DMA_CH3_INT_TXC
*\*\          - DMA_CH3_INT_HTX
*\*\          - DMA_CH3_INT_ERR
*\*\          - DMA_CH4_INT_GLB
*\*\          - DMA_CH4_INT_TXC
*\*\          - DMA_CH4_INT_HTX
*\*\          - DMA_CH4_INT_ERR
*\*\          - DMA_CH5_INT_GLB
*\*\          - DMA_CH5_INT_TXC
*\*\          - DMA_CH5_INT_HTX
*\*\          - DMA_CH5_INT_ERR
*\*\          - DMA_CH6_INT_GLB
*\*\          - DMA_CH6_INT_TXC
*\*\          - DMA_CH6_INT_HTX
*\*\          - DMA_CH6_INT_ERR
*\*\          - DMA_CH7_INT_GLB
*\*\          - DMA_CH7_INT_TXC
*\*\          - DMA_CH7_INT_HTX
*\*\          - DMA_CH7_INT_ERR
*\*\          - DMA_CH8_INT_GLB
*\*\          - DMA_CH8_INT_TXC
*\*\          - DMA_CH8_INT_HTX
*\*\          - DMA_CH8_INT_ERR
*\*\return  none.
*\*\note    Global interrupt state is the logic or generation of transfer completion
*\*\        interrupt, half-transfer interrupt, transfer error interrupt. In fact,
*\*\        after clearing the three interrupt states, the global interrupt state
*\*\        will also be cleared.
**/
void DMA_Interrupt_Status_Clear(DMA_Module* DMAx, uint32_t interrupt)
{
    /* Clear the selected DMA interrupt status bits */
    DMAx->INTCLR = interrupt;
}

/**
*\*\name    DMA_Channel_Request_Remap.
*\*\fun     Set DMA Channel x's remap request. Channel request mapping is flexible,
*\*\        allowing users to map any DMA request to any DMA channel as needed. It
*\*\        is important to note that there can be only one DMA request per DMA
*\*\        channel at a time.
*\*\param   DMAChx (The input parameters must be the following values):
*\*\          - DMA_CH1
*\*\          - DMA_CH2
*\*\          - DMA_CH3
*\*\          - DMA_CH4
*\*\          - DMA_CH5
*\*\          - DMA_CH6
*\*\          - DMA_CH7
*\*\          - DMA_CH8
*\*\param   req_remap (The input parameters must be the following values):
*\*\          - DMA_REMAP_ADC
*\*\          - DMA_REMAP_UART1_TX
*\*\          - DMA_REMAP_UART1_RX
*\*\          - DMA_REMAP_USART2_TX
*\*\          - DMA_REMAP_USART2_RX
*\*\          - DMA_REMAP_UART4_TX
*\*\          - DMA_REMAP_UART4_RX
*\*\          - DMA_REMAP_SPI1_TX
*\*\          - DMA_REMAP_SPI1_RX
*\*\          - DMA_REMAP_SPI2_TX
*\*\          - DMA_REMAP_SPI2_RX
*\*\          - DMA_REMAP_I2C1_TX
*\*\          - DMA_REMAP_I2C1_RX
*\*\          - DMA_REMAP_I2C2_TX
*\*\          - DMA_REMAP_I2C2_RX
*\*\          - DMA_REMAP_TIM1_CH1
*\*\          - DMA_REMAP_TIM1_CH2
*\*\          - DMA_REMAP_TIM1_CH3
*\*\          - DMA_REMAP_TIM1_CH4
*\*\          - DMA_REMAP_TIM1_COM
*\*\          - DMA_REMAP_TIM1_UP
*\*\          - DMA_REMAP_TIM1_TRIG
*\*\          - DMA_REMAP_TIM2_CH1
*\*\          - DMA_REMAP_TIM2_CH2
*\*\          - DMA_REMAP_TIM2_CH3
*\*\          - DMA_REMAP_TIM2_CH4
*\*\          - DMA_REMAP_TIM2_UP
*\*\          - DMA_REMAP_TIM3_CH1
*\*\          - DMA_REMAP_TIM3_CH3
*\*\          - DMA_REMAP_TIM3_CH4
*\*\          - DMA_REMAP_TIM3_UP
*\*\          - DMA_REMAP_TIM3_TRIG
*\*\          - DMA_REMAP_TIM4_CH1
*\*\          - DMA_REMAP_TIM4_CH2
*\*\          - DMA_REMAP_TIM4_CH3
*\*\          - DMA_REMAP_TIM4_UP
*\*\          - DMA_REMAP_TIM5_CH1
*\*\          - DMA_REMAP_TIM5_CH2
*\*\          - DMA_REMAP_TIM5_CH3
*\*\          - DMA_REMAP_TIM5_CH4
*\*\          - DMA_REMAP_TIM5_UP
*\*\          - DMA_REMAP_TIM5_TRIG
*\*\          - DMA_REMAP_TIM6_UP
*\*\          - DMA_REMAP_TIM8_CH1
*\*\          - DMA_REMAP_TIM8_CH2
*\*\          - DMA_REMAP_TIM8_CH3
*\*\          - DMA_REMAP_TIM8_CH4
*\*\          - DMA_REMAP_TIM8_COM
*\*\          - DMA_REMAP_TIM8_UP
*\*\          - DMA_REMAP_TIM8_TRIG
*\*\return  none.
**/
void DMA_Channel_Request_Remap(DMA_ChannelType* DMAChx, uint32_t req_remap)
{
    /* Set the selected DMA request remap */
    DMAChx->CHSEL = req_remap;
}

